# EFI: Prüfung vom 21.9.21 - Teil Datenstrukturen

### Aufgabe 0
Führe die folgenden Code-Zellen aus, um die für die Prüfung notwendigen Datenstrukturen zu erstellen.

`table_1` besteht aus einer Liste mit wiederum vier Listen aus vier Elementen

In [1]:
table_1 = [["a", "b", "c", "d"], [9, 1, 8, 2], ["e", "f", "g", "h"], [7, 3, 6, 4]]
table_1

[['a', 'b', 'c', 'd'], [9, 1, 8, 2], ['e', 'f', 'g', 'h'], [7, 3, 6, 4]]

`table_2` besteht aus einer Liste mit wiederum drei Listen aus drei Elementen

In [2]:
table_2 = [[88, 45, 20], [50, 30, 11], [90, 121, 13]]
table_2

[[88, 45, 20], [50, 30, 11], [90, 121, 13]]

`table_3` ist ein Pandas DataFrame, welches die gewonnenen Medaillen pro Land der vergangenen Olympiade in Tokyo enthält.

In [3]:
import pandas as pd
table_3 = pd.read_csv("olympic-medals.csv")
table_3

                          TEAM  Gold  Silver  Bronze
0     United States of America    39      41      33
1   People's Republic of China    38      32      18
2                        Japan    27      14      17
3                Great Britain    22      21      22
4                          ROC    20      28      23
..                         ...   ...     ...     ...
88                       Ghana     0       0       1
89                     Grenada     0       0       1
90                      Kuwait     0       0       1
91         Republic of Moldova     0       0       1
92        Syrian Arab Republic     0       0       1

[93 rows x 4 columns]

### Aufgabe 1

> Schreibe in die folgende Code-Zelle den Befehl, welcher den Eintrag `f` aus `table_1` ausgibt.
> * 1P für den korrekten Befehl

In [4]:
table_1[2][1]

'f'

### Aufgabe 2

> Schreibe in die folgende Code-Zelle den Befehl, welcher lediglich die Column mit den Ländernamen aus `table_3` selektiert und ausgibt.
> * 1P für den korrekten Befehl

In [5]:
table_3["TEAM"]

0       United States of America
1     People's Republic of China
2                          Japan
3                  Great Britain
4                            ROC
                 ...
88                         Ghana
89                       Grenada
90                        Kuwait
91           Republic of Moldova
92          Syrian Arab Republic
Name: TEAM, Length: 93, dtype: object

### Aufgabe 3
> Ersetze die Einträge `["a", "b", "c", "d"]` in `table_1` mit den Einträgen `["i", "j", "k", "l"]`.
> * 0.5P für das korrekte Ergebnis
> * 0.5P für nur einen Befehl, bzw. nur eine Code-Zeile

In [6]:
table_1[0] = ["i", "j", "k", "l"]

### Aufgabe 4
> Erstelle eine neue Column in `table_3`, welche den Namen `total` trägt und pro Land die Summe alles Medaillen (Gold + Silver + Bronze) enthält.
> * 1P für das korrekte Ergebnis

In [7]:
table_3["total"] = table_3["Gold"] + table_3["Silver"] + table_3["Bronze"]
table_3

                          TEAM  Gold  Silver  Bronze  total
0     United States of America    39      41      33    113
1   People's Republic of China    38      32      18     88
2                        Japan    27      14      17     58
3                Great Britain    22      21      22     65
4                          ROC    20      28      23     71
..                         ...   ...     ...     ...    ...
88                       Ghana     0       0       1      1
89                     Grenada     0       0       1      1
90                      Kuwait     0       0       1      1
91         Republic of Moldova     0       0       1      1
92        Syrian Arab Republic     0       0       1      1

[93 rows x 5 columns]

### Aufgabe 5

> Ersetze bei den Einträgen `9, 1, 8, 2` in `table_1` alle Einträge grösser als 5 mit dem Textzeichen `x`.
> * 0.5P für das korrekte Ergebnis
> * 0.5P für das Verwenden einer Iteration (z.B. for-Loop)

In [8]:
for i in range(4):
    if table_1[1][i] > 5:
        table_1[1][i] = "x"
        
table_1

[['i', 'j', 'k', 'l'], ['x', 1, 'x', 2], ['e', 'f', 'g', 'h'], [7, 3, 6, 4]]

### Aufgabe 6
> Schreibe in die folgende Code-Zelle den Befehl, welcher aus `table_3` lediglich die ersten drei Rows und die Columns `TEAM` und `Gold` selektiert/ausgibt.
> * 1P für das korrekte Ergebnis

In [9]:
table_3.iloc[0:3,0:2]

                         TEAM  Gold
0    United States of America    39
1  People's Republic of China    38
2                       Japan    27

### Aufgabe 7

> Befülle die Liste `res_1` mit den quadrierten Werten der Liste `[7, 3, 6, 4]` aus `table_1`.
> * 0.5P für das korrekte Ergebnis
> * 0.5P für das Verwenden einer Iteration (z.B. for-Loop)

In [10]:
res_1 = []

for elem in table_1[3]:
    res_1.append(elem * elem)
    
res_1

[49, 9, 36, 16]

### Aufgabe 8
> Schreibe in die folgende Code-Zelle den Befehl, welcher von `table_3` die grösste Anzahl Silbermedaillen ausgibt, welche ein Land gewonnen hat.
> * 1P für das korrekte Ergebnis

In [11]:
table_3["Silver"].max()

41

### Aufgabe 9

> Schreibe den Code, welcher den kleinsten Wert aus `table_2` ausgibt. *Tipp: Du kannst davon ausgehen, dass der kleinste Wert sicherlich kleiner ist, als die Zahl 1000.*
> * 0.5P für das Verwenden von verschachtelten Iterationen (z.B. for-Loops)
> * 0.5P für eine Logik, welche den kleinsten Wert selektiert

In [12]:
res = 100

for row in table_2:
    for elem in row:
        if elem < res:
            res = elem
            
res

11

### Aufgabe 10
> Schreibe in die folgende Code-Zelle den Code, welcher die Rows von den Ländern ausgibt, welche mindestens 20 Gold, 20 Silber und 20 Bronzemedaillen gewonnen haben.
> * 0.5P für den korrekten Syntax
> * 0.5P für die korrekte Logik

In [13]:
table_3[(table_3["Gold"] > 19) & (table_3["Silver"] > 19) & (table_3["Bronze"] > 19)]

                       TEAM  Gold  Silver  Bronze  total
0  United States of America    39      41      33    113
3             Great Britain    22      21      22     65
4                       ROC    20      28      23     71